src/InformationRegisters/ВыполнениеТестов/ВыполнениеТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыполнениеТестов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Пройден</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Тест</name>
    <type>
      <types>CatalogRef.АвтотестыСервисов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>UIDГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/АвтотестыСервисов/АвтотестыСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АвтотестыСервисов</name>
  <attributes>
    <name>ВходнойJSON</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Метод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Определитель</name>
    <type>
      <types>CatalogRef.ОпределителиТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеЗаголовков</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеПараметров</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>URL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаменяемыеПараметры</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <predefined>
    <items>
      <name>Ферапонт</name>
      <description>Ферапонт</description>
    </items>
    <items>
      <name>ЭтотПользователь</name>
      <description>Этот пользователь</description>
    </items>
  </predefined>
  <attributes>
    <name>Telegram</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VK</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Никнейм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешилПисатьVK</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеНастройки</name>
    <type>
      <types>CatalogRef.ПерсональныеНастройки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_БотОстановлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/МетодыТестирования/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьТест(Запрос, Метод) Экспорт
	
	Попытка
		
		Если Не Константы.ЗаписыватьТесты.Получить() Тогда
			Возврат;
		КонецЕсли;
		
		UID = Строка(Новый УникальныйИдентификатор);
		
		НовыйТест = Справочники.АвтотестыСервисов.СоздатьЭлемент();
		НовыйТест.Код					= UID;
		НовыйТест.Наименование 			= "Тест " + UID;
		НовыйТест.ВходнойJSON			= Запрос.ПолучитьТелоКакСтроку();
		НовыйТест.ХранилищеЗаголовков 	= Новый ХранилищеЗначения(Запрос.Заголовки);
		НовыйТест.ХранилищеПараметров 	= Новый ХранилищеЗначения(Запрос.ПараметрыЗапроса);
		НовыйТест.Метод 				= Метод;
		НовыйТест.URL					= Запрос.БазовыйURL + Запрос.ОтносительныйURL;
		НовыйТест.Записать();
		
	Исключение
		ИнструментарийВызовСервера.ЗаписьВЖурналИсключений(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗапускТеста(Тест, UIDГруппы = "") Экспорт
	
	РеквизитыТеста 	= ИнструментарийВызовСервера.ЗначенияРеквизитовОбъекта(Тест, "ВходнойJSON,Метод,URL,Определитель");
	JSONЗапроса		= РеквизитыТеста.ВходнойJSON;
	URL				= РеквизитыТеста.URL;
	UID				= Строка(Новый УникальныйИдентификатор);
	Определитель	= РеквизитыТеста.Определитель;
	ДопПараметры	= Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтотестыСервисовЗаменяемыеПараметры.Параметр КАК Параметр,
		|	АвтотестыСервисовЗаменяемыеПараметры.Значение КАК Значение
		|ИЗ
		|	Справочник.АвтотестыСервисов.ЗаменяемыеПараметры КАК АвтотестыСервисовЗаменяемыеПараметры
		|ГДЕ
		|	АвтотестыСервисовЗаменяемыеПараметры.Ссылка = &Тест";
	
	Запрос.УстановитьПараметр("Тест", Тест);
	
	РезультатЗапроса 		= Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		JSONЗапроса = СтрЗаменить(JSONЗапроса, "@" + ВыборкаДетальныеЗаписи.Параметр, ВыборкаДетальныеЗаписи.Значение);  
	КонецЦикла;
	
	ВыполнитьПредобработку(Определитель, JSONЗапроса,  ДопПараметры);
	
	Заголовки 			= Тест.ХранилищеЗаголовков.Получить();	
	ПараметрыЗапроса 	= Тест.ХранилищеПараметров.Получить();	
	
	Ответ = МетодыРаботыHttp.ЗапросПоПараметрамСервиса(Заголовки, ПараметрыЗапроса, URL, JSONЗапроса); 
	
	МЗ = РегистрыСведений.ВыполнениеТестов.СоздатьМенеджерЗаписи();
	МЗ.Период		= ТекущаяДатаСеанса();
	МЗ.UID 			= UID;
	МЗ.UIDГруппы 	= UIDГруппы;
	МЗ.Тест			= Тест;
	МЗ.Пройден		= ВыполнитьПостОбработку(Определитель, Ответ, ДопПараметры);
	МЗ.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОсновныеМетоды

Процедура ВыполнитьПредобработку(Знач Определитель, ТелоЗапроса, ДопПараметры)
	
	ОТ = Справочники.ОпределителиТестов;
	
	Если Определитель = ОТ.РегистрацияТелеграм  Тогда		
		РегистрацияТелеграм_Пред(ТелоЗапроса, ДопПараметры);		
	Иначе
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

Функция ВыполнитьПостобработку(Знач Определитель, Ответ, ДопПараметры)
	
	ОТ 		= Справочники.ОпределителиТестов;
	Пройден = Ложь;
	
	Если Определитель = ОТ.РегистрацияТелеграм  Тогда
		Пройден = РегистрацияТелеграм_Пост(Ответ, ДопПараметры);		
	Иначе
		Пройден = Истина;
	КонецЕсли;
	
	Возврат Пройден;
	
КонецФункции

#КонецОбласти

#Область МетодыОбработки

Процедура РегистрацияТелеграм_Пред(ТелоЗапроса, ДопПараметры)
	
	Актор = Справочники.Пользователи.ЭтотПользователь;
	
	ПользовательТестирования = Актор.ПолучитьОбъект();
	
	ДопПараметры.Вставить("Telegram", ПользовательТестирования.Telegram);
	
	ПользовательТестирования.Telegram = "";
	ПользовательТестирования.Записать();
	
КонецПроцедуры

Функция РегистрацияТелеграм_Пост(Ответ, ДопПараметры)
	
	Пройден = Ложь; 
	
	Телеграм				= ДопПараметры.Получить("Telegram");
	
	Если Не ЗначениеЗаполнено(Телеграм) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПользовательПоТелеграм 	= Справочники.Пользователи.НайтиПоРеквизиту("Telegram", Телеграм);  
	
	Если ЗначениеЗаполнено(ПользовательПоТелеграм) Тогда
		ПользовательПоТелеграм.ПолучитьОбъект().Удалить();
		
		ПользовательТестирования = Справочники.Пользователи.ЭтотПользователь.ПолучитьОбъект();
		ПользовательТестирования.Telegram = Телеграм;
		ПользовательТестирования.Записать();
		Пройден = Истина;
		
	КонецЕсли;
	
	Возврат Пройден;

КонецФункции

#КонецОбласти

#КонецОбласти
